Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/legislative/legislative_background_for_state_pension_non_contributory.html.txt.tmx
Source language: en
Languages: ga

source: Legislative background for State Pension (Non-Contributory)
ga: An Cúlra Reachtach maidir le Pinsean Stáit (Neamhranníocach)

source: The main legislative provisions relating to State Pension (Non-Contributory), previously called Old Age (Non-Contributory) Pension, are contained in:
ga: Tá na príomhfhorálacha reachtacha a bhaineann le Pinsean Stáit (Neamhranníocach) - ar a dtugtaí an Pinsean Seanaoise (Neamhranníocach) roimhe seo le fáil i:

source: • Chapter 4 of Part 3 of the Social Welfare (Consolidation) Act 2005 (Sections 152 to 160 inclusive) as amended; and in
ga: • Caibidil 4 de Chuid 3 den Acht Leasa Shóisialaigh (Comhdhlúthú), 2005 (Ailt 152 go 160 agus iad sin san áireamh) arna leasú; agus i

source: • Part 3 of Schedule 3 of the above Act (as amended)
ga: • gCuid 3 de Sceideal 3 den Acht thuasluaite (arna leasú)

source: • Chapter 7 of Part III of the Social Welfare (Consolidated Payments Provisions) Regulations 1994 (S.I
ga: • Caibidil 7 de Chuid III de na Rialacháin Leasa Shóisialaigh (Forálacha Íocaíochtaí Comhdhlúite) 1994 (I.R. Uimh

source: No.417 of 1994) (as amended)
ga: 417 de 1994) (arna leasú)

source: The Social Welfare Law Reform and Pensions Act 2006 (pdf) allowed for the name Old Age Non-Contributory Pension to change to State Pension (Non-Contributory)
ga: Forálann an tAcht um Athchóiriú an Dlí Leasa Shóisialaigh agus um Pinsin 2006 (pdf) go n-aistreofar ainm an Phinsin (Neamh-Ranníocach) Sean-Aoise go Pinsin Stáit (Neamh-Ranníocach)

source: The new name came into effect on 29 September, 2006
ga: Tháinig an t-ainm nua i bhfeidhm ar an 29 Meán Fómhair, 2006
